#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.

```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

Success! The configuration is valid.

time_sleep.wait_rbac_propagation: Refreshing state... [id=2024-07-31T17:19:19Z]
data.azurerm_client_config.current: Reading...
azurerm_resource_group.rg: Refreshing state... [id=/subscriptions/04378d5e-acd4-4f37-9048-ab746c3e385d/resourceGroups/CPEQ-dev]
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD01ZDRiMmFmYi1kYjhlLTQxYWYtOWY3NS02NDNlMDVhYzY4OGI7b2JqZWN0SWQ9ZTEyYzdiOWEtMjYyYi00NWMzLWE3OTAtZjZmZmNkNDBlNjNiO3N1YnNjcmlwdGlvbklkPTA0Mzc4ZDVlLWFjZDQtNGYzNy05MDQ4LWFiNzQ2YzNlMzg1ZDt0ZW5hbnRJZD0zYzcyNzI3OC0wZTEwLTRlOWUtOTBmNy0xNmM2ODFhYTE2ZGU=]
azurerm_user_assigned_identity.identity: Refreshing state... [id=/subscriptions/04378d5e-acd4-4f37-9048-ab746c3e385d/resourceGroups/CPEQ-dev/providers/Microsoft.ManagedIdentity/userAssignedIdentities/id-func-dev-canadaeast]
azurerm_container_registry.acr: Refreshing state... [id=/subscriptions/04378d5e-acd4-4f37-9048-ab746c3e385d/resourceGroups/CPEQ-dev/providers/Microsoft.ContainerRegistry/registries/crcpeqdevcanadaeast]
azurerm_role_assignment.build_pipeline: Refreshing state... [id=/subscriptions/04378d5e-acd4-4f37-9048-ab746c3e385d/resourceGroups/CPEQ-dev/providers/Microsoft.ContainerRegistry/registries/crcpeqdevcanadaeast/providers/Microsoft.Authorization/roleAssignments/d9492acf-7363-da13-8b88-c0ebabe093f6]
azurerm_role_assignment.acrpull: Refreshing state... [id=/subscriptions/04378d5e-acd4-4f37-9048-ab746c3e385d/resourceGroups/CPEQ-dev/providers/Microsoft.ContainerRegistry/registries/crcpeqdevcanadaeast/providers/Microsoft.Authorization/roleAssignments/43e4f08a-8d9d-5d3a-14b7-b98d8061d237]
azurerm_container_app_environment.environment: Refreshing state... [id=/subscriptions/04378d5e-acd4-4f37-9048-ab746c3e385d/resourceGroups/CPEQ-dev/providers/Microsoft.App/managedEnvironments/cae-cpeq-dev-canadaeast]
azurerm_container_app.app: Refreshing state... [id=/subscriptions/04378d5e-acd4-4f37-9048-ab746c3e385d/resourceGroups/CPEQ-dev/providers/Microsoft.App/containerApps/ca-cpeq-dev-canadaeast]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # azurerm_app_configuration.config will be created
  + resource "azurerm_app_configuration" "config" {
      + endpoint                   = (known after apply)
      + id                         = (known after apply)
      + local_auth_enabled         = false
      + location                   = "canadaeast"
      + name                       = "appcg-cpeq-dev-canadaeast"
      + primary_read_key           = (known after apply)
      + primary_write_key          = (known after apply)
      + public_network_access      = "Enabled"
      + purge_protection_enabled   = false
      + resource_group_name        = "CPEQ-dev"
      + secondary_read_key         = (known after apply)
      + secondary_write_key        = (known after apply)
      + sku                        = "free"
      + soft_delete_retention_days = 1
      + tags                       = {
          + "environment" = "dev"
          + "project"     = "CPEQ"
        }

      + identity {
          + identity_ids = [
              + "/subscriptions/04378d5e-acd4-4f37-9048-ab746c3e385d/resourceGroups/CPEQ-dev/providers/Microsoft.ManagedIdentity/userAssignedIdentities/id-func-dev-canadaeast",
            ]
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "UserAssigned"
        }
    }

  # azurerm_app_configuration_key.environment will be created
  + resource "azurerm_app_configuration_key" "environment" {
      + configuration_store_id = (known after apply)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + id                     = (known after apply)
      + key                    = "ENVIRONMENT"
      + locked                 = false
      + type                   = "kv"
      + value                  = "dev"
    }

  # azurerm_app_configuration_key.onedrive_client_id will be created
  + resource "azurerm_app_configuration_key" "onedrive_client_id" {
      + configuration_store_id = (known after apply)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + id                     = (known after apply)
      + key                    = "ONEDRIVE_CLIENT_ID"
      + locked                 = false
      + type                   = "vault"
      + vault_key_reference    = (known after apply)
    }

  # azurerm_app_configuration_key.onedrive_client_secret will be created
  + resource "azurerm_app_configuration_key" "onedrive_client_secret" {
      + configuration_store_id = (known after apply)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + id                     = (known after apply)
      + key                    = "ONEDRIVE_CLIENT_SECRET"
      + locked                 = false
      + type                   = "vault"
      + vault_key_reference    = (known after apply)
    }

  # azurerm_app_configuration_key.onedrive_drive_id will be created
  + resource "azurerm_app_configuration_key" "onedrive_drive_id" {
      + configuration_store_id = (known after apply)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + id                     = (known after apply)
      + key                    = "ONEDRIVE_DRIVE_ID"
      + locked                 = false
      + type                   = "kv"
      + value                  = "b!fslahRMOAUCsW5P8nXZ3cYwDnL6MT35NpJyHzlyxCgXt0TeRJiWPSb3gQmzCo3t2"
    }

  # azurerm_app_configuration_key.onedrive_folder_name will be created
  + resource "azurerm_app_configuration_key" "onedrive_folder_name" {
      + configuration_store_id = (known after apply)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + id                     = (known after apply)
      + key                    = "ONEDRIVE_FOLDER_NAME"
      + locked                 = false
      + type                   = "kv"
      + value                  = "infolettre_automatique"
    }

  # azurerm_app_configuration_key.onedrive_tenant_id will be created
  + resource "azurerm_app_configuration_key" "onedrive_tenant_id" {
      + configuration_store_id = (known after apply)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + id                     = (known after apply)
      + key                    = "ONEDRIVE_TENANT_ID"
      + locked                 = false
      + type                   = "vault"
      + vault_key_reference    = (known after apply)
    }

  # azurerm_app_configuration_key.openai_api_key will be created
  + resource "azurerm_app_configuration_key" "openai_api_key" {
      + configuration_store_id = (known after apply)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + id                     = (known after apply)
      + key                    = "OPENAI_API_KEY"
      + locked                 = false
      + type                   = "vault"
      + vault_key_reference    = (known after apply)
    }

  # azurerm_app_configuration_key.sharepoint_site_url will be created
  + resource "azurerm_app_configuration_key" "sharepoint_site_url" {
      + configuration_store_id = (known after apply)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + id                     = (known after apply)
      + key                    = "SHAREPOINT_SITE_URL"
      + locked                 = false
      + type                   = "kv"
      + value                  = "baselinequebec.sharepoint.com"
    }

  # azurerm_app_configuration_key.weaviate_grpc_port will be created
  + resource "azurerm_app_configuration_key" "weaviate_grpc_port" {
      + configuration_store_id = (known after apply)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + id                     = (known after apply)
      + key                    = "WEAVIATE_GRPC_PORT"
      + locked                 = false
      + type                   = "kv"
      + value                  = "50050"
    }

  # azurerm_app_configuration_key.weaviate_http_port will be created
  + resource "azurerm_app_configuration_key" "weaviate_http_port" {
      + configuration_store_id = (known after apply)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + id                     = (known after apply)
      + key                    = "WEAVIATE_HTTP_PORT"
      + locked                 = false
      + type                   = "kv"
      + value                  = "8079"
    }

  # azurerm_app_configuration_key.weaviate_persistence_data_path will be created
  + resource "azurerm_app_configuration_key" "weaviate_persistence_data_path" {
      + configuration_store_id = (known after apply)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + id                     = (known after apply)
      + key                    = "WEAVIATE_PERSISTENCE_DATA_PATH"
      + locked                 = false
      + type                   = "kv"
      + value                  = "./data/weaviate"
    }

  # azurerm_app_configuration_key.weaviate_version will be created
  + resource "azurerm_app_configuration_key" "weaviate_version" {
      + configuration_store_id = (known after apply)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + id                     = (known after apply)
      + key                    = "WEAVIATE_VERSION"
      + locked                 = false
      + type                   = "kv"
      + value                  = "1.25.5"
    }

  # azurerm_app_configuration_key.webscraper_io_api_key will be created
  + resource "azurerm_app_configuration_key" "webscraper_io_api_key" {
      + configuration_store_id = (known after apply)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + id                     = (known after apply)
      + key                    = "WEBSCRAPER_IO_API_KEY"
      + locked                 = false
      + type                   = "vault"
      + vault_key_reference    = (known after apply)
    }

  # azurerm_container_app.app will be updated in-place
  ~ resource "azurerm_container_app" "app" {
        id                            = "/subscriptions/04378d5e-acd4-4f37-9048-ab746c3e385d/resourceGroups/CPEQ-dev/providers/Microsoft.App/containerApps/ca-cpeq-dev-canadaeast"
        name                          = "ca-cpeq-dev-canadaeast"
        tags                          = {
            "environment" = "dev"
            "project"     = "CPEQ"
        }
        # (9 unchanged attributes hidden)

      ~ template {
            # (3 unchanged attributes hidden)

          ~ container {
              ~ memory            = "2Gi" -> "2.0Gi"
                name              = "infolettre-automatique"
                # (5 unchanged attributes hidden)
            }

            # (1 unchanged block hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # azurerm_key_vault.keyvault will be created
  + resource "azurerm_key_vault" "keyvault" {
      + access_policy                 = (known after apply)
      + enable_rbac_authorization     = true
      + id                            = (known after apply)
      + location                      = "canadaeast"
      + name                          = "kvcpeqdevcanadaeast"
      + public_network_access_enabled = true
      + purge_protection_enabled      = false
      + resource_group_name           = "CPEQ-dev"
      + sku_name                      = "standard"
      + soft_delete_retention_days    = 7
      + tags                          = {
          + "environment" = "dev"
          + "project"     = "CPEQ"
        }
      + tenant_id                     = "3c727278-0e10-4e9e-90f7-16c681aa16de"
      + vault_uri                     = (known after apply)
    }

  # azurerm_key_vault_secret.onedrive_client_id will be created
  + resource "azurerm_key_vault_secret" "onedrive_client_id" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "onedrive-client-id"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.onedrive_client_secret will be created
  + resource "azurerm_key_vault_secret" "onedrive_client_secret" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "onedrive-client-secret"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.onedrive_tenant_id will be created
  + resource "azurerm_key_vault_secret" "onedrive_tenant_id" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "onedrive-tenant-id"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.openai_api_key will be created
  + resource "azurerm_key_vault_secret" "openai_api_key" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "openai-api-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
        # (1 unchanged attribute hidden)
    }

  # azurerm_key_vault_secret.webscraper_io_api_key will be created
  + resource "azurerm_key_vault_secret" "webscraper_io_api_key" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "webscraper-io-api-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
        # (1 unchanged attribute hidden)
    }

  # azurerm_role_assignment.appconf_dataowner will be created
  + resource "azurerm_role_assignment" "appconf_dataowner" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "e12c7b9a-262b-45c3-a790-f6ffcd40e63b"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "App Configuration Data Owner"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.containerapp_read will be created
  + resource "azurerm_role_assignment" "containerapp_read" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "7bb14b37-797f-4401-8dcc-9a7600449512"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "App Configuration Data Reader"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.containerapp_read_secrets will be created
  + resource "azurerm_role_assignment" "containerapp_read_secrets" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "7bb14b37-797f-4401-8dcc-9a7600449512"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets User"
      + scope                            = "/subscriptions/04378d5e-acd4-4f37-9048-ab746c3e385d/resourceGroups/CPEQ-dev/providers/Microsoft.ContainerRegistry/registries/crcpeqdevcanadaeast"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.terraform_secrets will be created
  + resource "azurerm_role_assignment" "terraform_secrets" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "e12c7b9a-262b-45c3-a790-f6ffcd40e63b"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets Officer"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # time_sleep.wait_rbac_propagation will be destroyed
  # (because time_sleep.wait_rbac_propagation is not in configuration)
  - resource "time_sleep" "wait_rbac_propagation" {
      - create_duration = "1m" -> null
      - id              = "2024-07-31T17:19:19Z" -> null
      - triggers        = {
          - "build_pipeline" = "/subscriptions/04378d5e-acd4-4f37-9048-ab746c3e385d/resourceGroups/CPEQ-dev/providers/Microsoft.ContainerRegistry/registries/crcpeqdevcanadaeast"
          - "container_app"  = "/subscriptions/04378d5e-acd4-4f37-9048-ab746c3e385d/resourceGroups/CPEQ-dev/providers/Microsoft.ContainerRegistry/registries/crcpeqdevcanadaeast"
        } -> null
    }

  # time_sleep.wait_rbac_propagation_app_config will be created
  + resource "time_sleep" "wait_rbac_propagation_app_config" {
      + create_duration = "1m"
      + id              = (known after apply)
      + triggers        = {
          + "app_config" = (known after apply)
        }
    }

  # time_sleep.wait_rbac_propagation_container_app will be created
  + resource "time_sleep" "wait_rbac_propagation_container_app" {
      + create_duration = "1m"
      + id              = (known after apply)
      + triggers        = {
          + "build_pipeline" = "/subscriptions/04378d5e-acd4-4f37-9048-ab746c3e385d/resourceGroups/CPEQ-dev/providers/Microsoft.ContainerRegistry/registries/crcpeqdevcanadaeast"
          + "container_app"  = "/subscriptions/04378d5e-acd4-4f37-9048-ab746c3e385d/resourceGroups/CPEQ-dev/providers/Microsoft.ContainerRegistry/registries/crcpeqdevcanadaeast"
        }
    }

  # time_sleep.wait_rbac_propagation_secrets will be created
  + resource "time_sleep" "wait_rbac_propagation_secrets" {
      + create_duration = "1m"
      + id              = (known after apply)
      + triggers        = {
          + "build_pipeline" = "/subscriptions/04378d5e-acd4-4f37-9048-ab746c3e385d/resourceGroups/CPEQ-dev/providers/Microsoft.ContainerRegistry/registries/crcpeqdevcanadaeast"
          + "container_app"  = (known after apply)
        }
    }

Plan: 27 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
```

</details>

*Pusher: @emileturcotte, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform: Validate, Plan, Deploy`*